def info(X, y=None):
    if y is not None:
        """pandasの情報を出力する"""
        print('----------------------------------------------------------------------------------------')
        print('X shape: (%i,%i)' % X.shape)
        print('y shape: (%i,%i)' % y.shape)
        print('----------------------------------------------------------------------------------------')
        print(X.describe())
        print('----------------------------------------------------------------------------------------')
        print(X.join(y).head())
        print('----------------------------------------------------------------------------------------')

        if len(X.columns) is 1:
            # 目的変数に欠損が含まれているとアルゴリズムが学習できないためチェック
            print('Check the null count of the target variable: %i' % X.isnull().sum())
            print('----------------------------------------------------------------------------------------')
        if len(y.columns) is 1:
            # 目的変数に欠損が含まれているとアルゴリズムが学習できないためチェック
            print('Check the null count of the target variable: %i' % y.isnull().sum())
            print('----------------------------------------------------------------------------------------')
    else:
        """pandasの情報を出力する"""
        print('----------------------------------------------------------------------------------------')
        print('X shape: (%i,%i)' % X.shape)
        print('----------------------------------------------------------------------------------------')
        print(X.describe())
        print('----------------------------------------------------------------------------------------')
        print(X.head())
        print('----------------------------------------------------------------------------------------')
        if len(X.columns) is 1:
            # 目的変数に欠損が含まれているとアルゴリズムが学習できないためチェック
            print('Check the null count of the target variable: %i' % X.isnull().sum())
            print('----------------------------------------------------------------------------------------')
